# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_container_registry.altinncr: Reading...
data.azurerm_container_registry.altinncr: Read complete after 1s [id=/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/resourceGroups/acr/providers/Microsoft.ContainerRegistry/registries/altinncr]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_container_app.container_app must be replaced
-/+ resource "azurerm_container_app" "container_app" {
      ~ container_app_environment_id  = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/altinn-apim-test-rg/providers/Microsoft.App/managedEnvironments/altinn-apim-test-hcpyxw-acaenv" -> (known after apply) # forces replacement
      ~ custom_domain_verification_id = (sensitive value)
      ~ id                            = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/altinn-apim-test-rg/providers/Microsoft.App/containerApps/altinn-apim-test-hcpyxw-aca" -> (known after apply)
      ~ latest_revision_fqdn          = "altinn-apim-test-hcpyxw-aca--nzxfcip.bluesky-7db654ab.norwayeast.azurecontainerapps.io" -> (known after apply)
      ~ latest_revision_name          = "altinn-apim-test-hcpyxw-aca--nzxfcip" -> (known after apply)
      ~ location                      = "norwayeast" -> (known after apply)
      - max_inactive_revisions        = 0 -> null
      ~ name                          = "altinn-apim-test-hcpyxw-aca" -> (known after apply) # forces replacement
      ~ outbound_ip_addresses         = [
          - "20.100.227.68",
        ] -> (known after apply)
      - tags                          = {} -> null
        # (3 unchanged attributes hidden)

      ~ identity {
          ~ identity_ids = [
              - "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/altinn-apim-test-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/altinn-apim-test-hcpyxw-aca-mi",
            ] -> (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ ingress {
          ~ custom_domain              = [] -> (known after apply)
          - exposed_port               = 0 -> null
          ~ fqdn                       = "altinn-apim-test-hcpyxw-aca.bluesky-7db654ab.norwayeast.azurecontainerapps.io" -> (known after apply)
            # (5 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ registry {
          ~ identity             = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/altinn-apim-test-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/altinn-apim-test-hcpyxw-aca-mi" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ template {
          + revision_suffix                  = (known after apply)
            # (3 unchanged attributes hidden)

          ~ container {
              - command           = [] -> null
              ~ ephemeral_storage = "2Gi" -> (known after apply)
                name              = "dis-demo-pgsql"
                # (4 unchanged attributes hidden)

              ~ liveness_probe {
                  ~ termination_grace_period_seconds = 0 -> (known after apply)
                    # (8 unchanged attributes hidden)
                }

              ~ startup_probe {
                  ~ termination_grace_period_seconds = 0 -> (known after apply)
                    # (8 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }
    }

  # azurerm_container_app_environment.container_app_environment must be replaced
-/+ resource "azurerm_container_app_environment" "container_app_environment" {
      ~ custom_domain_verification_id               = "13CFCB559E965A255CC28B1CB584632471F09E8B7FD7939BB40F4DD1F0587A7D" -> (known after apply)
      ~ default_domain                              = "bluesky-7db654ab.norwayeast.azurecontainerapps.io" -> (known after apply)
      + docker_bridge_cidr                          = (known after apply)
      ~ id                                          = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/altinn-apim-test-rg/providers/Microsoft.App/managedEnvironments/altinn-apim-test-hcpyxw-acaenv" -> (known after apply)
      + logs_destination                            = (known after apply)
      ~ name                                        = "altinn-apim-test-hcpyxw-acaenv" -> (known after apply) # forces replacement
      + platform_reserved_cidr                      = (known after apply)
      + platform_reserved_dns_ip_address            = (known after apply)
      ~ static_ip_address                           = "20.251.2.217" -> (known after apply)
      - tags                                        = {} -> null
        # (9 unchanged attributes hidden)
    }

  # azurerm_role_assignment.altinncr_acrpull must be replaced
-/+ resource "azurerm_role_assignment" "altinncr_acrpull" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/resourceGroups/acr/providers/Microsoft.ContainerRegistry/registries/altinncr/providers/Microsoft.Authorization/roleAssignments/8c64949c-1377-b554-3318-6d4cf89eacff" -> (known after apply)
      ~ name                                   = "8c64949c-1377-b554-3318-6d4cf89eacff" -> (known after apply)
      ~ principal_id                           = "e4362974-fc67-44a2-904f-7db7d448ef92" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/providers/Microsoft.Authorization/roleDefinitions/7f951dda-4ed3-4680-a7ca-43fe172d538d" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_user_assigned_identity.acaghr_managed_identity must be replaced
-/+ resource "azurerm_user_assigned_identity" "acaghr_managed_identity" {
      ~ client_id           = "53472307-d6bc-4df1-8630-01643aeaa59f" -> (known after apply)
      ~ id                  = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/altinn-apim-test-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/altinn-apim-test-hcpyxw-aca-mi" -> (known after apply)
      ~ name                = "altinn-apim-test-hcpyxw-aca-mi" -> (known after apply) # forces replacement
      ~ principal_id        = "e4362974-fc67-44a2-904f-7db7d448ef92" -> (known after apply)
      - tags                = {} -> null
      ~ tenant_id           = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # random_string.name must be replaced
-/+ resource "random_string" "name" {
      ~ id          = "hcpyxw" -> (known after apply)
      ~ length      = 6 -> 7 # forces replacement
      ~ result      = "hcpyxw" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

Plan: 5 to add, 0 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @monteiro-renato |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/altinn-apim-test-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/altinn-apim-test-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_altinn-apim-test-rg.tfstate.tfplan`